#include <iostream>
#include <conio.h>
#include <windows.h>
#include <string>
using namespace std;
int main()
{
	setlocale(LC_CTYPE, "rus");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	char str[200]="";
	int k;
	do
	{
		cout << "1-определение разницы значений кодов в ASCII буквы в прописном и строчном написании, если введен символ латинского алфавита,\n2-определение разницы значений кодов в Windows-1251 буквы в прописном и строчном написании, если введен символ русского алфавита,\n3-вывод в консоль кода символа, соответствующего введенной цифре,\n4-выход из программы\n";
		cout << "\nВведите номер варианта: ";
		cin >> k;
		switch (k)
		{
			case 1:
			{
				cout << "Введите символ : ";
				cin >> str;
				for(int i=0; i<strlen(str);i++)
				{
					if (str[i] >= 'A' && str[i] <= 'Z'|| str[i] >= 'a' && str[i] <= 'z')
					{
						if (str[i] >= 'A' && str[i] <= 'Z')
						{
							cout << str[i] << ": Разница значений кодов строчной и прописной буквы равна 0х20\n" <<"Верхний регистр: "<< int(str[i]) << "\t" <<"Нижний регистр: "<< int(str[i]) + 32<<"\n";
						}
						else
						{
							cout << str[i] << ": Разница значений кодов строчной и прописной буквы равна 0х20\n" << "Верхний регистр: " << int(str[i]) - 32 << "\t" << "Нижний регистр: " << int(str[i]) <<"\n";
						}
					}
					else
					{
						cout << str[i]<<": Введенный символ не является латинской буквой\n";
					}
					

				}
				cout << "\n";
				break;
			}
			case 2:
			{
				cout << "Введите символ: ";
				cin >> str;
				for (int i = 0; i < strlen(str); i++)
				{
					if (str[i] >= 'А' && str[i] <= 'Я' || str[i] >= 'а' && str[i] <= 'я'|| str[i]=='ё' || str[i]=='Ё')
					{
						if (str[i] >= 'А' && str[i] <= 'Я' || str[i] == 'Ё')
						{
							cout << str[i] << ": Разница значений кодов строчной и прописной буквы равна 0х20\n" << "Верхний регистр: " << (byte)str[i]+0 << "\t" << "Нижний регистр: " << (byte)str[i] + 32 << "\n";
						}
						else
						{
							cout << str[i] << ": Разница значений кодов строчной и прописной буквы равна 0х20\n" << "Верхний регистр: " << ((byte)str[i] - 32 )<< "\t" << "Нижний регистр: " << (byte)str[i]+0 << "\n";
						}
					}
					else
					{
						cout << str[i]<< ": Введенный символ не является русской буквой\n";
					}
				}
				cout << "\n";
				break;
			}
			case 3:
			{
				cout << "\nВведите символ: ";
				cin >> str;
				for (int i = 0; i < strlen(str); i++)
				{
					if (str[i] >= '0' && str[i] <= '9')
					{
						cout <<str[i]<<": "<< int(str[i]) << "\n";
					}
					else
					{
						cout <<str[i]<< ": Введенный символ не является цифрой\n"; 
					}
				}
				cout << "\n";
				break;
			}
		}
	} while (k != 4);
}